# Cable Size Dispose Method

Source: https://www.revitapidocs.com/2026/a86677b8-02d3-892b-5125-5859f8279a6d.htm

---

| Cable Size Dispose Method |
| --- |

Releases all resources used by the CableSize
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace